## Slide Link https://github.com/Make-School-Courses/DS-1.1-Data-Analysis/blob/master/Lessons/AppliedDescriptiveStatistics.md

In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
#percent of passangers depart from C?
#Percent female?

df[df['Embarked'] == 'C']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [37]:
pd.crosstab((df['Embarked'] == 'C'), df['Sex'])

Sex       female  male
Embarked
False        241   482
True          73    95

In [36]:
pd.crosstab(df['Sex'], (df['Embarked'] == 'C'))

Embarked  False  True
Sex
female      241     73
male        482     95

In [47]:
pd.crosstab(df['Sex'], (df['Embarked'] == 'C'), normalize = 'all').sum()

Embarked
False    0.811448
True     0.188552
dtype: float64

In [26]:
#solution 1: take values from c and divide by total sum, then do only for female
pd.crosstab(df['Sex'], df['Embarked'])

Embarked   C   Q    S
Sex
female    73  36  203
male      95  41  441

In [27]:
#solution 2:
len(df[df['Embarked'] == 'C'])/df['Embarked'].notna().sum()

0.1889763779527559

In [31]:
#total embarked
(73+95)/(73+36+203+95+41+441)

0.1889763779527559

In [32]:
#Females who embarked
73/(73+36+203)

0.23397435897435898

In [34]:
#remove the null values of one tab
df[df['Embarked'].notnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [35]:
df[df['Embarked'].notnull()]['Sex'].value_counts()['female']

312

In [63]:
# Average age of male passengers that survive


df[df['Sex'] == 'male']['Survived']

0      0
4      0
5      0
6      0
7      0
      ..
883    0
884    0
886    0
889    1
890    0
Name: Survived, Length: 577, dtype: int64

In [50]:
pd.crosstab(df['Sex'], (df['Survived']))

Survived    0    1
Sex
female     81  233
male      468  109

In [52]:
print(df[(df['Survived'] == 1) & (df['Sex'] == 'male')]['Age'].mean())

27.276021505376345

In [79]:
#calculate the median value

len((df[(df['Survived'] == 1) & (df['Sex'] == 'male')]['Age']).dropna().sort_values())

93

In [80]:
len((df[(df['Survived'] == 1) & (df['Sex'] == 'male')]['Age']).dropna().sort_values()) / 2

46.5

In [81]:
93 - 46

47

In [89]:
print((df[(df['Survived'] == 1) & (df['Sex'] == 'male')]['Age']).dropna().sort_values())

803     0.42
755     0.67
831     0.83
78      0.83
305     0.92
       ...
449    52.00
647    56.00
587    60.00
570    62.00
630    80.00
Name: Age, Length: 93, dtype: float64

In [90]:
newdf = (df[(df['Survived'] == 1) & (df['Sex'] == 'male')]['Age']).dropna().sort_values())

print(newdf)

SyntaxError: invalid syntax (<ipython-input-90-97539353fdc8>, line 1)